# URL: https://school.programmers.co.kr/learn/courses/30/lessons/68935
# 요약: n을 3진법 상에서 앞뒤로 뒤집은 후, 이를 다시 10진법으로 표현한 수 return
#   예: 45 -> 1200 -> 0021 -> 7


# ================================================================
# 내 풀이

def solution(n):
    a = ""
    b = 0
    
    while n > 0:
        a = a + str(n % 3)         
        n = n // 3

    for i in a:
        for k in range(len(a)):
            b = b + i*(3**(len(a)-k-1))
                       
    return b
                       
# ----------------------------------------------------------------
# 이중 for문을 사용하는 대신, enumerate를 사용할 것

  
# ================================================================
# 수정 풀이

def solution(n):
    a = ""
    b = 0
    
    while n > 0:
        a = a + str(n % 3)
        n = n // 3

    for k, i in enumerate(a):
        b = b + int(i)*(3**(len(a)-k-1))
                       
    return b
# ----------------------------------------------------------------

# for k, i in enumerate(a):
# (0, '0') → k=0, i='0'
# (1, '0') → k=1, i='0'
# (2, '2') → k=2, i='2'
# (3, '1') → k=3, i='1'

# int(i)*(3**(len(a)-k-1))
# 진법 계산은 뒤에서부터 0제곱, 1제곱, 2제곱이기 때문에 len(a)-k-1로 표현
