# URL: https://school.programmers.co.kr/learn/courses/30/lessons/12903
# 요약: 단어의 가운데 글자 반환. 홀수면 1개, 짝수면 2개


# ================================================================
# 내 풀이

def solution(s):
     
    if s % 2 != 0:
        answer = s[len(s) // 2]
    else:
        answer = s[len(s) // 2 -1 : 2]
    
    return answer
# ----------------------------------------------------------------
# 1. 'if s % 2 != 0' 에서 s는 숫자가 아님. s의 '길이'로 바꿔줘야 함
# 2. [ : ] 사용 시, 3번부터 2개는 [3 : 2] 가 아니라 [3 : 5]로 써야 함


# ================================================================
# 수정 풀이

def solution(s):
     
    if len(s) % 2 != 0:
        answer = s[len(s) // 2]
    else:
        answer = s[len(s) // 2 -1 : len(s) // 2 +1]
    
    return answer

# ----------------------------------------------------------------
# 간단히 수정

def solution(s):

   return s[len(s) // 2] if len(s) % 2 != 0 else s[len(s) // 2 -1 : len(s) // 2 +1]

  
# ================================================================
# ★다른 풀이

def solution(s):
    return s[(len(s)-1)//2 : len(s)//2 + 1]

''' ----------------------------------------------------------------
(홀수) abcdefg  [3:4] -> 3부터 4 이전까지(3 / 1개)
(len(s)-1)//2 : 3
len(s)//2 + 1 : 4

(짝수) hkjk  [1:3] -> 1부터 3 이전까지(1, 2 / 2개)
(len(s)-1)//2 : 1
len(s)//2 + 1 : 3
'''
