# URL: https://school.programmers.co.kr/learn/courses/30/lessons/12928
# 요약: n의 약수를 모두 더한 값 return


# ================================================================
# 내 풀이

def solution(n):
    for i in range(1, n):
        if n % i == 0:
            return i
    return sum(i)

# ----------------------------------------------------------------
# 1. range(1, n) -> n-1까지 수이기 때문에 'n+1'이라고 써야 함
# 2.  return i -> for문에 대해 if를 만족하는 i가 나오면 종료
#                 그럼 1로 종료되기 때문에, 반복 수행하며 더해지는 문법 필요


# ================================================================
# 완성 풀이

def solution(n):
    a = 0
    for i in range(1, n+1):
        if n % i == 0:
            a += i
    return a

# ----------------------------------------------------------------
# for 반복문으로 조건을 만족하는 값을 더하고 싶다면 구조 기억하기


# ================================================================
# 간단히 풀이

def solution(n):
    return sum(i for i in range(1, n+1) if n%i ==0)


