# URL: https://school.programmers.co.kr/learn/courses/30/lessons/12932
# 요약: (입력) 12345 -> (출력) [5,4,3,2,1]
# 못 품


# ================================================================
# 내 풀이

def solution(n):
    N = n.split()
    a = count(N)
    A = a-i
    for A in N:
        return "".join(A)


# ----------------------------------------------------------------
# 기냥 엉망임..
      

# ================================================================
# 완성 풀이

def solution(n):
  N = str(n)
  chars = list(N)

  a = ""

  for i in chars:
    a = i + a

  return list(map(int, a)))


# ----------------------------------------------------------------
