# URL: https://school.programmers.co.kr/learn/courses/30/lessons/12932
# 요약: (입력) 12345 -> (출력) [5,4,3,2,1]
# 못 품


# ================================================================
# 내 풀이

def solution(n):
    N = n.split()
    a = count(N)
    A = a-i
    for A in N:
        return "".join(A)


# ----------------------------------------------------------------
# 기냥 엉망임..
      

# ================================================================
# 수정 풀이

def solution(n):
  N = str(n)                   # N = n.split()   이걸 쓰면 그냥 리스트가 되는 줄..
  chars = list(N)              # 옆의 두 줄처럼 문자열로 바꿔서 리스트로 바꿔야 한다

  a = ""

  for i in chars:
    a = i + a                  # 평소 사용했던 a = a + i와는 다름. 이건 뒤집기!
                               # 기존 a의 앞쪽에 다음 i를 붙이는 방

  return list(map(int, a))


# ================================================================
# 다른 풀이

def solution(n):
    return list(map(int, str(n)[::-1]))

# ----------------------------------------------------------------

# "12345"[::-1] -> "54321"

# 슬라이싱 [시작 : 끝 : 간격]
# [:]    -> 처음부터 끝까지              12345[:]    -> 12345
# [::1]  -> 원래 그대로                  12345[::1]  -> 12345
# [::2]  -> 앞에서부터 2칸씩             12345[::2]  -> 135
# [::-1] -> 뒤에서부터 1칸씩             12345[::-1] -> 54321
# [::-2] -> 뒤에서부터 2칸씩             12345[::-1] -> 531


