# URL: https://school.programmers.co.kr/learn/courses/30/lessons/12969
# 요약: 


# ================================================================
# 내 풀이

a, b = map(int, input().strip().split(' '))

for _ in range(1, b+1):
    print('*' * a)

# ================================================================
# ★ 다른 풀이

a, b = map(int, input().split())
print(('*' * a + '\n') * b, end='')

''' ----------------------------------------------------------------
('*' * a + '\n')                : *을 a만큼 반복하고 줄바꾸기
('*' * a + '\n') * b            : b번 만큼 반복
('*' * a + '\n') * b, end=''    : 마지막 줄의 '\n'는 end=''로 제거
'''
 
