# URL: https://school.programmers.co.kr/learn/courses/30/lessons/181949
# 요약 : 대소문자 바꿔 출력하기
# 내 풀이 -> 손도 못 댐


# =====================================================================
# 완성 코드1

print(input().swapcase())

#----------------------------------------------------------------------
# swapcase() : 문자열의 모든 대소문자를 반전해서 반환


# =====================================================================
# 완성 코드2

a = input()
b = ''

for i in a:                    # .isupper() : 대문자인지 확인
  if i.islower():              # .islower() : 소문자인지 확인
    b = b + i.upper()          # .upper()   : 대문자로 변환
  else:                        # .lower()   : 소문자로 변환
    b = b + i.lower()          # ㅠ += i.lower() 가능

print(b)


# =====================================================================
# 완성코드 3

a = input()

for i in a:
  if i.islower():
    print(i.upper(), end = "")
  else:
    print(i.lower(), end = "")

#----------------------------------------------------------------------
# 각각의 문자를 그대로 붙일 때, for in 뒤에
# 'a += 함수()' 또는, 'print(함수(), end = "")' 사용

