# URL: https://school.programmers.co.kr/learn/courses/30/lessons/181947
# 요약: 4 5 를 입력하고 '4 + 5 = 9' 형태를 출력하시오.


# ================================================================
# 내 풀이(1차)
a, b = map(int, input().split())
print(f'a + b = {a} + {b}')                 

# ----------------------------------------------------------------
# print(f'a + b = {a} + {b}')       -> a + b = 4 + 5
# print(f'a + b = {a+b}')           -> a + b = 9
# 4와 5가 계산이 되려면 {} 안에 모두 넣어야 함

# print(f'a + b = {a+b}')           -> a + b = 9
# print(f'{a} + {b} = {a+b}')       -> 4 + 5 = 9
# 좌변도 a와 b 값에 따라 변하려면 {} 필요


# ================================================================
# 내 풀이(2차)
a, b = map(int, input().split())
print('a + b =', a+b)

# ----------------------------------------------------------------
# print('a + b =', a+b)            -> a + b = 9
# print(a, '+', b, '=', a+b)       -> 4 + 5 = 9
# 따옴표 안에 들어간 a, b는 문자로 나오기 때문에 각각 나눠서 +, = 에만 따옴표
