# URL: https://school.programmers.co.kr/learn/courses/30/lessons/181945
# 요약: (입력) abcde -> (출력) abcde 일렬로


# ================================================================
# 내 풀이

str = input()
for i in str:
    print(i)


# ================================================================
# 다른 풀이 1

print('\n'.join(input()))

# input()에 abc를 입력하면 ['a', 'b', 'c']를 의미함
# '\n'.join() : 줄바꿈으로 연결해라
# 즉, 입력한 값을 줄바꿈으로 연결해라

# ----------------------------------------------------------------
# 다른 풀이 2

print(*input(), sep='\n')

# input(abc)          = [a, b, c]
# *input(abc)         = 'a', 'b', 'c'    *(언패킹) : 묶인 걸 풀어라. 즉 하나씩을 의미
# *input(), sep='\n'  = a                각각을 \n(줄바꿈)으로 연결해라
#                       b
#                       c
