# URL: https://school.programmers.co.kr/learn/courses/30/lessons/181946
# 요약: (입력) apple pen -> (출력) applepen 


# ================================================================
# 내 풀이
a, b = input().split(' ')
print(f'{a}{b}')


# ================================================================
# 내 것도 맞긴 한데 다른 것도 참고해보자

#1 
print(input().strip().replace(' ', ''))

# strip() : 앞뒤 공백, 줄바꿈 제거
# replace(' ', '') : ' '(공백)을 ''(빈 문자열)로 바꾼다


# 2 ----------------------------------------------------------------

a, b = input().split(' ')
print(a, b, sep='')

# sep='' : a와 b를 ''(빈 문자열)로 연결하라
# sep='-' 이런 식도 가능


# 3 ----------------------------------------------------------------

print(''.join(input().split(' ')))

# ''.join(여러 개의 문자열) : 여러 개의 문자열을 ''(빈 문자열로)로 연결하라
