# URL: https://school.programmers.co.kr/learn/courses/30/lessons/181950
# 요약 : string 5 -> string을 5번 반복하시오


# ===========================================================================
# 내 풀이
a, b = input().split()
b = int(b)
print('a' * b)                # a는 입력받은 값이기 때문에 ''가 없어야 한다

# ---------------------------------------------------------------------------
# 수정
a, b = input().split()
b = int(b)
print(a * b) 


# ===========================================================================
# 다른 풀이

print(a * int(b))              # 더 간단히 가능!

# ---------------------------------------------------------------------------

for i in range(int(b)):
  print(a, end = "")

# range(5) : 0, 1, 2, 3, 4 생성
# for i in range(5): 0부터 4까지 총 5회 반복해라

# print(a) : 기본 print()는 줄을 바꿔 내보낸다
# print(a, end = "") : 줄을 바꾸지 말고 "" 빈 문자열로 변경. 즉 줄바꿈 x

